XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_ctrl_reg.h
/* 0x818 : ef_sw_cfg_0 */
#define EF_CTRL_EF_SW_CFG_0_OFFSET         (0x818)
#define EF_CTRL_EF_SW_SF_AES_MODE          EF_CTRL_EF_SW_SF_AES_MODE
#define EF_CTRL_EF_SW_SF_AES_MODE_POS      (0U)
#define EF_CTRL_EF_SW_SF_AES_MODE_LEN      (2U)
#define EF_CTRL_EF_SW_SF_AES_MODE_MSK      (((1U << EF_CTRL_EF_SW_SF_AES_MODE_LEN) - 1) << EF_CTRL_EF_SW_SF_AES_MODE_POS)
#define EF_CTRL_EF_SW_SF_AES_MODE_UMSK     (~(((1U << EF_CTRL_EF_SW_SF_AES_MODE_LEN) - 1) << EF_CTRL_EF_SW_SF_AES_MODE_POS))
#define EF_CTRL_EF_SW_AI_DIS               EF_CTRL_EF_SW_AI_DIS
#define EF_CTRL_EF_SW_AI_DIS_POS           (2U)
#define EF_CTRL_EF_SW_AI_DIS_LEN           (1U)
#define EF_CTRL_EF_SW_AI_DIS_MSK           (((1U << EF_CTRL_EF_SW_AI_DIS_LEN) - 1) << EF_CTRL_EF_SW_AI_DIS_POS)
#define EF_CTRL_EF_SW_AI_DIS_UMSK          (~(((1U << EF_CTRL_EF_SW_AI_DIS_LEN) - 1) << EF_CTRL_EF_SW_AI_DIS_POS))
#define EF_CTRL_EF_SW_CPU0_DIS             EF_CTRL_EF_SW_CPU0_DIS
#define EF_CTRL_EF_SW_CPU0_DIS_POS         (3U)
#define EF_CTRL_EF_SW_CPU0_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_CPU0_DIS_MSK         (((1U << EF_CTRL_EF_SW_CPU0_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU0_DIS_POS)
#define EF_CTRL_EF_SW_CPU0_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_CPU0_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU0_DIS_POS))
#define EF_CTRL_EF_SW_SBOOT_EN             EF_CTRL_EF_SW_SBOOT_EN
#define EF_CTRL_EF_SW_SBOOT_EN_POS         (4U)
#define EF_CTRL_EF_SW_SBOOT_EN_LEN         (2U)
#define EF_CTRL_EF_SW_SBOOT_EN_MSK         (((1U << EF_CTRL_EF_SW_SBOOT_EN_LEN) - 1) << EF_CTRL_EF_SW_SBOOT_EN_POS)
#define EF_CTRL_EF_SW_SBOOT_EN_UMSK        (~(((1U << EF_CTRL_EF_SW_SBOOT_EN_LEN) - 1) << EF_CTRL_EF_SW_SBOOT_EN_POS))
#define EF_CTRL_EF_SW_UART_DIS             EF_CTRL_EF_SW_UART_DIS
#define EF_CTRL_EF_SW_UART_DIS_POS         (6U)
#define EF_CTRL_EF_SW_UART_DIS_LEN         (4U)
#define EF_CTRL_EF_SW_UART_DIS_MSK         (((1U << EF_CTRL_EF_SW_UART_DIS_LEN) - 1) << EF_CTRL_EF_SW_UART_DIS_POS)
#define EF_CTRL_EF_SW_UART_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_UART_DIS_LEN) - 1) << EF_CTRL_EF_SW_UART_DIS_POS))
#define EF_CTRL_EF_SW_BLE2_DIS             EF_CTRL_EF_SW_BLE2_DIS
#define EF_CTRL_EF_SW_BLE2_DIS_POS         (10U)
#define EF_CTRL_EF_SW_BLE2_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_BLE2_DIS_MSK         (((1U << EF_CTRL_EF_SW_BLE2_DIS_LEN) - 1) << EF_CTRL_EF_SW_BLE2_DIS_POS)
#define EF_CTRL_EF_SW_BLE2_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_BLE2_DIS_LEN) - 1) << EF_CTRL_EF_SW_BLE2_DIS_POS))
#define EF_CTRL_EF_SW_M1542_DIS            EF_CTRL_EF_SW_M1542_DIS
#define EF_CTRL_EF_SW_M1542_DIS_POS        (11U)
#define EF_CTRL_EF_SW_M1542_DIS_LEN        (1U)
#define EF_CTRL_EF_SW_M1542_DIS_MSK        (((1U << EF_CTRL_EF_SW_M1542_DIS_LEN) - 1) << EF_CTRL_EF_SW_M1542_DIS_POS)
#define EF_CTRL_EF_SW_M1542_DIS_UMSK       (~(((1U << EF_CTRL_EF_SW_M1542_DIS_LEN) - 1) << EF_CTRL_EF_SW_M1542_DIS_POS))
#define EF_CTRL_EF_SW_SF_KEY_RE_SEL        EF_CTRL_EF_SW_SF_KEY_RE_SEL
#define EF_CTRL_EF_SW_SF_KEY_RE_SEL_POS    (12U)
#define EF_CTRL_EF_SW_SF_KEY_RE_SEL_LEN    (2U)
#define EF_CTRL_EF_SW_SF_KEY_RE_SEL_MSK    (((1U << EF_CTRL_EF_SW_SF_KEY_RE_SEL_LEN) - 1) << EF_CTRL_EF_SW_SF_KEY_RE_SEL_POS)
#define EF_CTRL_EF_SW_SF_KEY_RE_SEL_UMSK   (~(((1U << EF_CTRL_EF_SW_SF_KEY_RE_SEL_LEN) - 1) << EF_CTRL_EF_SW_SF_KEY_RE_SEL_POS))
#define EF_CTRL_EF_SW_SDU_DIS              EF_CTRL_EF_SW_SDU_DIS
#define EF_CTRL_EF_SW_SDU_DIS_POS          (14U)
#define EF_CTRL_EF_SW_SDU_DIS_LEN          (1U)
#define EF_CTRL_EF_SW_SDU_DIS_MSK          (((1U << EF_CTRL_EF_SW_SDU_DIS_LEN) - 1) << EF_CTRL_EF_SW_SDU_DIS_POS)
#define EF_CTRL_EF_SW_SDU_DIS_UMSK         (~(((1U << EF_CTRL_EF_SW_SDU_DIS_LEN) - 1) << EF_CTRL_EF_SW_SDU_DIS_POS))
#define EF_CTRL_EF_SW_BTDM_DIS             EF_CTRL_EF_SW_BTDM_DIS
#define EF_CTRL_EF_SW_BTDM_DIS_POS         (15U)
#define EF_CTRL_EF_SW_BTDM_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_BTDM_DIS_MSK         (((1U << EF_CTRL_EF_SW_BTDM_DIS_LEN) - 1) << EF_CTRL_EF_SW_BTDM_DIS_POS)
#define EF_CTRL_EF_SW_BTDM_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_BTDM_DIS_LEN) - 1) << EF_CTRL_EF_SW_BTDM_DIS_POS))
#define EF_CTRL_EF_SW_WIFI_DIS             EF_CTRL_EF_SW_WIFI_DIS
#define EF_CTRL_EF_SW_WIFI_DIS_POS         (16U)
#define EF_CTRL_EF_SW_WIFI_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_WIFI_DIS_MSK         (((1U << EF_CTRL_EF_SW_WIFI_DIS_LEN) - 1) << EF_CTRL_EF_SW_WIFI_DIS_POS)
#define EF_CTRL_EF_SW_WIFI_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_WIFI_DIS_LEN) - 1) << EF_CTRL_EF_SW_WIFI_DIS_POS))
#define EF_CTRL_EF_SW_0_KEY_ENC_EN         EF_CTRL_EF_SW_0_KEY_ENC_EN
#define EF_CTRL_EF_SW_0_KEY_ENC_EN_POS     (17U)
#define EF_CTRL_EF_SW_0_KEY_ENC_EN_LEN     (1U)
#define EF_CTRL_EF_SW_0_KEY_ENC_EN_MSK     (((1U << EF_CTRL_EF_SW_0_KEY_ENC_EN_LEN) - 1) << EF_CTRL_EF_SW_0_KEY_ENC_EN_POS)
#define EF_CTRL_EF_SW_0_KEY_ENC_EN_UMSK    (~(((1U << EF_CTRL_EF_SW_0_KEY_ENC_EN_LEN) - 1) << EF_CTRL_EF_SW_0_KEY_ENC_EN_POS))
#define EF_CTRL_EF_SW_CAM_DIS              EF_CTRL_EF_SW_CAM_DIS
#define EF_CTRL_EF_SW_CAM_DIS_POS          (18U)
#define EF_CTRL_EF_SW_CAM_DIS_LEN          (1U)
#define EF_CTRL_EF_SW_CAM_DIS_MSK          (((1U << EF_CTRL_EF_SW_CAM_DIS_LEN) - 1) << EF_CTRL_EF_SW_CAM_DIS_POS)
#define EF_CTRL_EF_SW_CAM_DIS_UMSK         (~(((1U << EF_CTRL_EF_SW_CAM_DIS_LEN) - 1) << EF_CTRL_EF_SW_CAM_DIS_POS))
#define EF_CTRL_EF_SW_M154_DIS             EF_CTRL_EF_SW_M154_DIS
#define EF_CTRL_EF_SW_M154_DIS_POS         (19U)
#define EF_CTRL_EF_SW_M154_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_M154_DIS_MSK         (((1U << EF_CTRL_EF_SW_M154_DIS_LEN) - 1) << EF_CTRL_EF_SW_M154_DIS_POS)
#define EF_CTRL_EF_SW_M154_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_M154_DIS_LEN) - 1) << EF_CTRL_EF_SW_M154_DIS_POS))
#define EF_CTRL_EF_SW_CPU1_DIS             EF_CTRL_EF_SW_CPU1_DIS
#define EF_CTRL_EF_SW_CPU1_DIS_POS         (20U)
#define EF_CTRL_EF_SW_CPU1_DIS_LEN         (1U)
#define EF_CTRL_EF_SW_CPU1_DIS_MSK         (((1U << EF_CTRL_EF_SW_CPU1_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU1_DIS_POS)
#define EF_CTRL_EF_SW_CPU1_DIS_UMSK        (~(((1U << EF_CTRL_EF_SW_CPU1_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU1_DIS_POS))
#define EF_CTRL_EF_SW_CPU_RST_DBG_DIS      EF_CTRL_EF_SW_CPU_RST_DBG_DIS
#define EF_CTRL_EF_SW_CPU_RST_DBG_DIS_POS  (21U)
#define EF_CTRL_EF_SW_CPU_RST_DBG_DIS_LEN  (1U)
#define EF_CTRL_EF_SW_CPU_RST_DBG_DIS_MSK  (((1U << EF_CTRL_EF_SW_CPU_RST_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU_RST_DBG_DIS_POS)
#define EF_CTRL_EF_SW_CPU_RST_DBG_DIS_UMSK (~(((1U << EF_CTRL_EF_SW_CPU_RST_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_CPU_RST_DBG_DIS_POS))
#define EF_CTRL_EF_SW_SE_DBG_DIS           EF_CTRL_EF_SW_SE_DBG_DIS
#define EF_CTRL_EF_SW_SE_DBG_DIS_POS       (22U)
#define EF_CTRL_EF_SW_SE_DBG_DIS_LEN       (1U)
#define EF_CTRL_EF_SW_SE_DBG_DIS_MSK       (((1U << EF_CTRL_EF_SW_SE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_SE_DBG_DIS_POS)
#define EF_CTRL_EF_SW_SE_DBG_DIS_UMSK      (~(((1U << EF_CTRL_EF_SW_SE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_SE_DBG_DIS_POS))
#define EF_CTRL_EF_SW_EFUSE_DBG_DIS        EF_CTRL_EF_SW_EFUSE_DBG_DIS
#define EF_CTRL_EF_SW_EFUSE_DBG_DIS_POS    (23U)
#define EF_CTRL_EF_SW_EFUSE_DBG_DIS_LEN    (1U)
#define EF_CTRL_EF_SW_EFUSE_DBG_DIS_MSK    (((1U << EF_CTRL_EF_SW_EFUSE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_EFUSE_DBG_DIS_POS)
#define EF_CTRL_EF_SW_EFUSE_DBG_DIS_UMSK   (~(((1U << EF_CTRL_EF_SW_EFUSE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_SW_EFUSE_DBG_DIS_POS))
#define EF_CTRL_EF_SW_DBG_JTAG_1_DIS       EF_CTRL_EF_SW_DBG_JTAG_1_DIS
#define EF_CTRL_EF_SW_DBG_JTAG_1_DIS_POS   (24U)
#define EF_CTRL_EF_SW_DBG_JTAG_1_DIS_LEN   (2U)
#define EF_CTRL_EF_SW_DBG_JTAG_1_DIS_MSK   (((1U << EF_CTRL_EF_SW_DBG_JTAG_1_DIS_LEN) - 1) << EF_CTRL_EF_SW_DBG_JTAG_1_DIS_POS)
#define EF_CTRL_EF_SW_DBG_JTAG_1_DIS_UMSK  (~(((1U << EF_CTRL_EF_SW_DBG_JTAG_1_DIS_LEN) - 1) << EF_CTRL_EF_SW_DBG_JTAG_1_DIS_POS))
#define EF_CTRL_EF_SW_DBG_JTAG_0_DIS       EF_CTRL_EF_SW_DBG_JTAG_0_DIS
#define EF_CTRL_EF_SW_DBG_JTAG_0_DIS_POS   (26U)
#define EF_CTRL_EF_SW_DBG_JTAG_0_DIS_LEN   (2U)
#define EF_CTRL_EF_SW_DBG_JTAG_0_DIS_MSK   (((1U << EF_CTRL_EF_SW_DBG_JTAG_0_DIS_LEN) - 1) << EF_CTRL_EF_SW_DBG_JTAG_0_DIS_POS)
#define EF_CTRL_EF_SW_DBG_JTAG_0_DIS_UMSK  (~(((1U << EF_CTRL_EF_SW_DBG_JTAG_0_DIS_LEN) - 1) << EF_CTRL_EF_SW_DBG_JTAG_0_DIS_POS))
#define EF_CTRL_EF_SW_DBG_MODE             EF_CTRL_EF_SW_DBG_MODE
#define EF_CTRL_EF_SW_DBG_MODE_POS         (28U)
#define EF_CTRL_EF_SW_DBG_MODE_LEN         (4U)
#define EF_CTRL_EF_SW_DBG_MODE_MSK         (((1U << EF_CTRL_EF_SW_DBG_MODE_LEN) - 1) << EF_CTRL_EF_SW_DBG_MODE_POS)
#define EF_CTRL_EF_SW_DBG_MODE_UMSK        (~(((1U << EF_CTRL_EF_SW_DBG_MODE_LEN) - 1) << EF_CTRL_EF_SW_DBG_MODE_POS))

