XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_ctrl_reg.h
    /* 0x81C : ef_reserved */
    union {
        struct {
            uint32_t ef_reserved : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } ef_reserved;

    /* 0x820 : ef_if_sw_usage_0 */
    union {
        struct {
            uint32_t ef_if_sw_usage_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_sw_usage_0;

    /* 0x824 : ef_if_sw_usage_1 */
    union {
        struct {
            uint32_t ef_if_sw_usage_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_sw_usage_1;

    /* 0x828  reserved */
    uint8_t RESERVED0x828[216];

    /* 0x900 : ef_if_ctrl_1 */
    union {
        struct {
            uint32_t reserved_0_1       : 2;  /* [ 1: 0],       rsvd,        0x0 */
            uint32_t ef_if_1_busy       : 1;  /* [    2],          r,        0x0 */
            uint32_t ef_if_1_rw         : 1;  /* [    3],        r/w,        0x0 */
            uint32_t ef_if_1_trig       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t ef_if_1_manual_en  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t ef_if_1_cyc_modify : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_19      : 13; /* [19: 7],       rsvd,        0x0 */
            uint32_t ef_if_1_int        : 1;  /* [   20],          r,        0x0 */
            uint32_t ef_if_1_int_clr    : 1;  /* [   21],        r/w,        0x1 */
            uint32_t ef_if_1_int_set    : 1;  /* [   22],        r/w,        0x0 */
            uint32_t reserved_23_31     : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_ctrl_1;

    /* 0x904 : ef_if_1_manual */
    union {
        struct {
            uint32_t reserved_0_15  : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t ef_if_1_q      : 8;  /* [23:16],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_1_manual;

    /* 0x908 : ef_if_1_status */
    union {
        struct {
            uint32_t ef_if_1_status : 32; /* [31: 0],          r,     0xe400 */
        } BF;
        uint32_t WORD;
    } ef_if_1_status;

    /* 0x90c  reserved */
    uint8_t RESERVED0x90c[4];

    /* 0x910 : ef_if_ctrl_2 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_ctrl_2;

    /* 0x914 : ef_if_2_manual */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_2_manual;

    /* 0x918 : ef_if_2_status */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_2_status;

    /* 0x91c  reserved */
    uint8_t RESERVED0x91c[228];

    /* 0xA00 : ef_crc_ctrl_0 */
    union {
        struct {
            uint32_t ef_crc_busy        : 1;  /* [    0],          r,        0x0 */
            uint32_t ef_crc_trig        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ef_crc_en          : 1;  /* [    2],        r/w,        0x1 */
            uint32_t ef_crc_mode        : 1;  /* [    3],        r/w,        0x0 */
            uint32_t ef_crc_error       : 1;  /* [    4],          r,        0x0 */
            uint32_t ef_crc_dout_inv_en : 1;  /* [    5],        r/w,        0x1 */
            uint32_t ef_crc_dout_endian : 1;  /* [    6],        r/w,        0x0 */
            uint32_t ef_crc_din_endian  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t ef_crc_int         : 1;  /* [    8],          r,        0x0 */
            uint32_t ef_crc_int_clr     : 1;  /* [    9],        r/w,        0x1 */
            uint32_t ef_crc_int_set     : 1;  /* [   10],        r/w,        0x0 */
            uint32_t ef_crc_lock        : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ef_crc_slp_n       : 16; /* [31:16],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_0;

    /* 0xA04 : ef_crc_ctrl_1 */
    union {
        struct {
            uint32_t ef_crc_data_0_en : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_1;

    /* 0xA08 : ef_crc_ctrl_2 */
    union {
        struct {
            uint32_t ef_crc_data_1_en : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_2;

    /* 0xA0C : ef_crc_ctrl_3 */
    union {
        struct {
            uint32_t ef_crc_iv : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_3;

    /* 0xA10 : ef_crc_ctrl_4 */
    union {
        struct {
            uint32_t ef_crc_golden : 32; /* [31: 0],        r/w, 0xc2a8fa9dL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_4;

    /* 0xA14 : ef_crc_ctrl_5 */
    union {
        struct {
            uint32_t ef_crc_dout : 32; /* [31: 0],          r, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } ef_crc_ctrl_5;
};

typedef volatile struct ef_ctrl_reg ef_ctrl_reg_t;

#endif /* __EF_CTRL_REG_H__ */
